[PredatorSpinUp X2AbilityTemplate]
LocFriendlyName="Power Up"
LocLongDescription="Accelerate ammo feed system, reduce mobility and damage but allow unit to fire one additional shot each trigger."
LocHelpText="Reduce mobility and damage but allow unit to fire one additional shot each trigger. Cannot be used after movement."
LocFlyOverText="Power Up"

[PredatorMk2SpinUp X2AbilityTemplate]
LocFriendlyName="Power Up"
LocLongDescription="Accelerate ammo feed system, reduce mobility and damage but allow unit to fire one additional shot each trigger."
LocHelpText="Reduce mobility and damage but allow unit to fire one additional shot each trigger. Cannot be used after movement."
LocFlyOverText="Power Up"

[PredatorSpinUp_Cancel X2AbilityTemplate]
LocFriendlyName="Power Down"
LocLongDescription="Stablize ammo feeding, restore the unit's mobility and per-shot damage."
LocHelpText="Stablize ammo feeding, restore the unit's mobility and per-shot damage."
LocFlyOverText="Power Down"

[PredatorStandardShot X2AbilityTemplate]
LocFriendlyName="Fire Weapon"
LocHelpText="Fire a shot at a target."
LocLongDescription="Firing the primary weapon always ends a unit's turn."

[PredatorBurstStart X2AbilityTemplate]
LocFriendlyName="Fire Weapon"
LocLongDescription="Fire multiple shots depending on spin-up level."
LocHelpText="Fire multiple shots depending on spin-up level."

[PredatorSpinUp_Penalty X2AbilityTemplate]
LocFriendlyName="Damage Penalty"
LocLongDescription="For each spin up, most single-target attacks from primary weapon get 8% damage penalty."
LocHelpText="For each spin up, most single-target attacks from primary weapon get 8% damage penalty."

[CancelPowerShot X2AbilityTemplate]
LocFriendlyName="Cancel Powershot"
LocLongDescription="Cancel previously activated Dual Powershot."
LocHelpText="Cancel previously activated Dual Powershot."

[DualPowerShot_Long X2AbilityTemplate]
LocFriendlyName="Dual Powershot (Long Range)"
LocLongDescription="Target an area. After a powershot, immediately firing another long range shot at targeted point."
LocHelpText="Target an area. After a powershot, immediately firing another long range shot at targeted point."

[DualPowerShot_Short X2AbilityTemplate]
LocFriendlyName="Dual Powershot (Close Range)"
LocLongDescription="Target an area. After a powershot, immediately firing another close range shot at targeted point."
LocHelpText="Target an area. After a powershot, immediately firing another close range shot at targeted point."

[TriplePowerShot X2AbilityTemplate]
LocFriendlyName="Triple Powershot"
LocLongDescription="Target an area. After dual powershots, immediately firing a special powershot at targeted point."
LocHelpText="Target an area. After dual powershots, immediately firing a special powershot at targeted point."

[PredatorPowerShot_Long X2AbilityTemplate]
LocFriendlyName="Power Shot (Long Range)"
LocLongDescription="Fire a long range projectile which pierces through and damages all units in a straight line."
LocHelpText="Fire a long range projectile which pierces through and damages all units in a straight line."

[PredatorPowerShot_Short X2AbilityTemplate]
LocFriendlyName="Power Shot (Close Range)"
LocLongDescription="Fire a cluster of short range projectiles which damage all units within a cone."
LocHelpText="Fire a cluster of short range projectiles which damage all units within a cone."

[PredatorCannon X2WeaponTemplate]
FriendlyName="Predator Cannon"
FriendlyNamePlural="Predator Cannon"
BriefSummary="A powerful but physically-heavy cannon designed specifically for use by SPARK units."
TacticalText="<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="Predator Cannon"

[PredatorCannonMk2 X2WeaponTemplate]
FriendlyName="Predator Cannon Mk.II"
FriendlyNamePlural="Predator Cannon Mk.II"
BriefSummary="A powerful but physically-heavy cannon designed specifically for use by SPARK units."
TacticalText="<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="Predator Cannon Mk.II"

[PredatorCannonMk3 X2WeaponTemplate]
FriendlyName="Predator Cannon Mk.III"
FriendlyNamePlural="Predator Cannon Mk.III"
BriefSummary="A powerful but physically-heavy cannon designed specifically for use by SPARK units."
TacticalText="<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="Predator Cannon Mk.III"

[Tech_PredatorCannon X2TechTemplate]
DisplayName="Predator Cannon"
Summary="Predator Cannon is the super heavy version of minigun carried by regular solider, providing heavy firepower and can only be used by our SPARKs. Predator cannon has a spin-up mechanism which greatly enhance its power at the cost of unit's mobility, ammo consumption and stability. This weapon is designed to bolster capabilities of Legion Chassis, a SPARK with both equipped can support our troops with unmatched firepower."
CodeName="Predator"